t/SpeedTouch-706/Inform.xml

<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
 <soapenv:Header>
<cwmp:ID soapenv:mustUnderstand="1">22_THOM_TR69_ID</cwmp:ID>
 </soapenv:Header>
 <soapenv:Body>
<cwmp:Inform>
<DeviceId>
 <Manufacturer>THOMSON</Manufacturer>
 <OUI>00147F</OUI>
 <ProductClass>SpeedTouch 706</ProductClass>
 <SerialNumber>CP0636JT3SH</SerialNumber>
</DeviceId>
<Event soap:arrayType="cwmp:EventStruct[01]">
<EventStruct>
 <EventCode>2 PERIODIC</EventCode>
 <CommandKey></CommandKey>
</EventStruct>
</Event>
<MaxEnvelopes>2</MaxEnvelopes>
<CurrentTime>1970-01-01T03:18:53Z</CurrentTime>
<RetryCount>10</RetryCount>
<ParameterList soap:arrayType="cwmp:ParameterValueStruct[12]">
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceSummary</Name>
 <Value xsi:type="xsd:string">InternetGatewayDevice:1.1[] (Baseline:1, EthernetLAN:1, ADSLWAN:1, Bridging:1, Time:1)</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.SpecVersion</Name>
 <Value xsi:type="xsd:string">1.1</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.HardwareVersion</Name>
 <Value xsi:type="xsd:string">BANT-S</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.SoftwareVersion</Name>
 <Value xsi:type="xsd:string">6.2.15.5</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name>
 <Value xsi:type="xsd:string"></Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.VendorConfigFile.1.Name</Name>
 <Value xsi:type="xsd:string">Routed PPPoE on 0/35 and 8/35</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.VendorConfigFile.1.Version</Name>
 <Value xsi:type="xsd:string"></Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.VendorConfigFile.1.Date</Name>
 <Value xsi:type="xsd:dateTime">0000-00-00T00:00:00</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.DeviceInfo.VendorConfigFile.1.Description</Name>
 <Value xsi:type="xsd:string">Factory Defaults</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.ManagementServer.ConnectionRequestURL</Name>
 <Value xsi:type="xsd:string">http://192.168.1.254:51005/</Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>InternetGatewayDevice.ManagementServer.ParameterKey</Name>
 <Value xsi:type="xsd:string"></Value>
</ParameterValueStruct>
<ParameterValueStruct>
 <Name>.ExternalIPAddress</Name>
 <Value xsi:type="xsd:string">192.168.1.254</Value>
</ParameterValueStruct>
</ParameterList>
</cwmp:Inform>
 </soapenv:Body>
</soapenv:Envelope>
